## 🧾 Terraform Plan for `gov_cloudtrail`

> ⚠️ Review this carefully before applying changes

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gov_cloudtrail_advanced.aws_cloudtrail.this[0] will be created
  + resource "aws_cloudtrail" "this" {
      + arn                           = (known after apply)
      + cloud_watch_logs_group_arn    = (known after apply)
      + cloud_watch_logs_role_arn     = (known after apply)
      + enable_log_file_validation    = true
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = true
      + is_multi_region_trail         = true
      + is_organization_trail         = true
      + kms_key_id                    = (known after apply)
      + name                          = "enterprise-org-wide-trail"
      + s3_bucket_name                = "my-org-cloudtrail-logs"
      + tags                          = {
          + "Compliance"  = "SOC2"
          + "Environment" = "prod"
          + "Owner"       = "Bluebit"
        }
      + tags_all                      = {
          + "Compliance"  = "SOC2"
          + "Environment" = "prod"
          + "Owner"       = "Bluebit"
        }

      + insight_selector {
          + insight_type = "ApiCallRateInsight"
        }
    }

  # module.gov_cloudtrail_advanced.aws_cloudwatch_log_group.cloudtrail[0] will be created
  + resource "aws_cloudwatch_log_group" "cloudtrail" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/cloudtrail/organization"
      + name_prefix       = (known after apply)
      + retention_in_days = 180
      + skip_destroy      = false
      + tags              = {
          + "Compliance"  = "SOC2"
          + "Environment" = "prod"
          + "Owner"       = "Bluebit"
        }
      + tags_all          = {
          + "Compliance"  = "SOC2"
          + "Environment" = "prod"
          + "Owner"       = "Bluebit"
        }
    }

  # module.gov_cloudtrail_advanced.aws_iam_role.cloudtrail_cloudwatch[0] will be created
  + resource "aws_iam_role" "cloudtrail_cloudwatch" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloudtrail-cloudwatch-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.gov_cloudtrail_advanced.aws_iam_role_policy_attachment.cloudtrail_cloudwatch[0] will be created
  + resource "aws_iam_role_policy_attachment" "cloudtrail_cloudwatch" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSCloudTrailLoggingPolicy"
      + role       = "cloudtrail-cloudwatch-role"
    }

  # module.gov_cloudtrail_advanced.aws_kms_alias.cloudtrail[0] will be created
  + resource "aws_kms_alias" "cloudtrail" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/cloudtrail-logs"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.gov_cloudtrail_advanced.aws_kms_key.cloudtrail[0] will be created
  + resource "aws_kms_key" "cloudtrail" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for CloudTrail log encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags                               = {
          + "Compliance"  = "SOC2"
          + "Environment" = "prod"
          + "Owner"       = "Bluebit"
        }
      + tags_all                           = {
          + "Compliance"  = "SOC2"
          + "Environment" = "prod"
          + "Owner"       = "Bluebit"
        }
    }

  # module.gov_cloudtrail_advanced.aws_s3_bucket.cloudtrail_logs[0] will be created
  + resource "aws_s3_bucket" "cloudtrail_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-org-cloudtrail-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Compliance"  = "SOC2"
          + "Environment" = "prod"
          + "Owner"       = "Bluebit"
        }
      + tags_all                    = {
          + "Compliance"  = "SOC2"
          + "Environment" = "prod"
          + "Owner"       = "Bluebit"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.gov_cloudtrail_advanced.aws_s3_bucket_lifecycle_configuration.cloudtrail_logs[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "cloudtrail_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "log-archive"
          + status = "Enabled"

          + expiration {
              + days                         = 3650
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
            }

          + noncurrent_version_transition {
              + newer_noncurrent_versions = "1"
              + noncurrent_days           = 60
              + storage_class             = "GLACIER"
            }

          + transition {
              + days          = 60
              + storage_class = "GLACIER"
            }
        }
    }

  # module.gov_cloudtrail_advanced.aws_s3_bucket_policy.cloudtrail[0] will be created
  + resource "aws_s3_bucket_policy" "cloudtrail" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.gov_cloudtrail_advanced.aws_s3_bucket_server_side_encryption_configuration.cloudtrail_logs[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "cloudtrail_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.gov_cloudtrail_advanced.aws_s3_bucket_versioning.cloudtrail_logs[0] will be created
  + resource "aws_s3_bucket_versioning" "cloudtrail_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.gov_cloudtrail_basic.aws_cloudtrail.this[0] will be created
  + resource "aws_cloudtrail" "this" {
      + arn                           = (known after apply)
      + enable_log_file_validation    = true
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = true
      + is_multi_region_trail         = true
      + is_organization_trail         = false
      + name                          = "core-audit-basic"
      + s3_bucket_name                = "my-basic-cloudtrail-logs"
      + tags                          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
        }
      + tags_all                      = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
        }
    }

  # module.gov_cloudtrail_basic.aws_s3_bucket.cloudtrail_logs[0] will be created
  + resource "aws_s3_bucket" "cloudtrail_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-basic-cloudtrail-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.gov_cloudtrail_basic.aws_s3_bucket_policy.cloudtrail[0] will be created
  + resource "aws_s3_bucket_policy" "cloudtrail" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.gov_cloudtrail_basic.aws_s3_bucket_server_side_encryption_configuration.cloudtrail_logs[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "cloudtrail_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.gov_cloudtrail_basic.aws_s3_bucket_versioning.cloudtrail_logs[0] will be created
  + resource "aws_s3_bucket_versioning" "cloudtrail_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 7, in provider "aws":
   7:   s3_force_path_style         = true

Use s3_use_path_style instead.

(and one more similar warning elsewhere)

Warning: Attribute Deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 7, in provider "aws":
   7:   s3_force_path_style         = true

Use s3_use_path_style instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->